# Shell and CLI
brew "zsh"
brew "git"
brew "gh"
brew "fnm"
brew "pnpm"
brew "starship"
brew "zoxide"
brew "eza"
brew "bat"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "jq"
brew "yq"
brew "ast-grep"
brew "hyperfine"
brew "tokei"
brew "shellcheck"
brew "shfmt"
brew "git-delta"
brew "lazygit"
brew "btop"
brew "openjdk@21"
brew "uv"
brew "mas"

# Rust (toolchain installed via rust.sh; these are the supporting tools)
brew "rustup"
brew "sccache"
brew "cargo-binstall"

# Apps
cask "1password"
cask "betterdisplay"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "codex"
cask "figma"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "qlmarkdown"
cask "raycast"
cask "slack"
cask "spotify"
cask "stats"
cask "syntax-highlight"
cask "visual-studio-code"
cask "xcodes-app"

# Mac App Store apps (requires being signed into the App Store)
mas "TestFlight", id: 899247664
mas "Amphetamine", id: 937984704
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
